Fix ASCCI diagram -> Mermaid (#6)
